Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ1024EFH100.atdf
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="FRC divided by FRCDIV bits" name="FRCDIV" value="0x0"/>
         <value caption="System PLL" name="SPLL" value="0x1"/>
         <value caption="Primary Osc (HS,EC)" name="POSC" value="0x2"/>
         <value caption="Low Power Secondary Osc (SOSC)" name="SOSC" value="0x4"/>
         <value caption="Low Power RC Osc (LPRC)" name="LPRC" value="0x5"/>
      </value-group>
      <value-group caption="Deadman Timer Count Window Interval bits" name="DEVCFG1__DMTINTV">
         <value caption="Window/Interval value is zero" name="WIN_0" value="0x0"/>
         <value caption="Window/Interval value is 1/2 counter value" name="WIN_1_2" value="0x1"/>
         <value caption="Window/Interval value is 3/4 counter value" name="WIN_3_4" value="0x2"/>
         <value caption="Window/Interval value is 7/8 counter value" name="WIN_7_8" value="0x3"/>
         <value caption="Window/Interval value is 15/16 counter value" name="WIN_15_16" value="0x4"/>
         <value caption="Window/Interval value is 31/32 counter value" name="WIN_31_32" value="0x5"/>
         <value caption="Window/Interval value is 63/64 counter value" name="WIN_63_64" value="0x6"/>
         <value caption="Window/Interval value is 127/128 counter value" name="WIN_127_128" value="0x7"/>
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disable SOSC" name="OFF" value="0x0"/>
         <value caption="Enable SOSC" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled" name="OFF" value="0x0"/>
         <value caption="Internal External Switchover mode is enabled" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="EC mode selected" name="EC" value="0x0"/>
         <value caption="HS Oscillator mode selected" name="HS" value="0x2"/>
         <value caption="POSC disabled" name="OFF" value="0x3"/>
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="CLKO output disabled" name="OFF" value="0x1"/>
         <value caption="CLKO output signal active on the OSC2 pin" name="ON" value="0x0"/>
      </value-group>
      <value-group caption="Clock Switching and Monitoring Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Clock Switch Disabled, FSCM Disabled" name="CSDCMD" value="0x0"/>
         <value caption="Clock Switch Enabled, FSCM Disabled" name="CSECMD" value="0x1"/>
         <value caption="Clock Switch Disabled, FSCM Enabled" name="CSDCME" value="0x2"/>
         <value caption="Clock Switch Enabled, FSCM Enabled" name="CSECME" value="0x3"/>
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1" name="PS1" value="0x0"/>
         <value caption="1:2" name="PS2" value="0x1"/>
         <value caption="1:4" name="PS4" value="0x2"/>
         <value caption="1:8" name="PS8" value="0x3"/>
         <value caption="1:16" name="PS16" value="0x4"/>
         <value caption="1:32" name="PS32" value="0x5"/>
         <value caption="1:64" name="PS64" value="0x6"/>
         <value caption="1:128" name="PS128" value="0x7"/>
         <value caption="1:256" name="PS256" value="0x8"/>
         <value caption="1:512" name="PS512" value="0x9"/>
         <value caption="1:1024" name="PS1024" value="0xa"/>
         <value caption="1:2048" name="PS2048" value="0xb"/>
         <value caption="1:4096" name="PS4096" value="0xc"/>
         <value caption="1:8192" name="PS8192" value="0xd"/>
         <value caption="1:16384" name="PS16384" value="0xe"/>
         <value caption="1:32768" name="PS32768" value="0xf"/>
         <value caption="1:65536" name="PS65536" value="0x10"/>
         <value caption="1:131072" name="PS131072" value="0x11"/>
         <value caption="1:262144" name="PS262144" value="0x12"/>
         <value caption="1:524288" name="PS524288" value="0x13"/>
         <value caption="1:1048576" name="PS1048576" value="0x14"/>
      </value-group>
      <value-group caption="Watchdog Timer Stop During Flash Programming bit" name="DEVCFG1__WDTSPGM">
         <value caption="WDT runs during Flash programming" name="RUN" value="0x0"/>
         <value caption="WDT stops during Flash programming" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="DEVCFG1__WINDIS">
         <value caption="Watchdog Timer is in non-Window mode" name="NORMAL" value="0x1"/>
         <value caption="Watchdog Timer is in Window mode" name="WINDOW" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="Watchdog Timer is not enabled; it can be enabled in software" name="OFF" value="0x0"/>
         <value caption="Watchdog Timer is enabled and cannot be disabled by software" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="DEVCFG1__FWDTWINSZ">
         <value caption="Window size is 25%" name="WINSZ_25" value="0x3"/>
         <value caption="Window size is 37.5%" name="WINSZ_37" value="0x2"/>
         <value caption="Window size is 50%" name="WINSZ_50" value="0x1"/>
         <value caption="Window size is 75%" name="WINSZ_75" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Count Select bits" name="DEVCFG1__DMTCNT">
         <value caption="2^8 (256)" name="DMT8" value="0x0"/>
         <value caption="2^9 (512)" name="DMT9" value="0x1"/>
         <value caption="2^10 (1024)" name="DMT10" value="0x2"/>
         <value caption="2^11 (2048)" name="DMT11" value="0x3"/>
         <value caption="2^12 (4096)" name="DMT12" value="0x4"/>
         <value caption="2^13 (8192)" name="DMT13" value="0x5"/>
         <value caption="2^14 (16384)" name="DMT14" value="0x6"/>
         <value caption="2^15 (32768)" name="DMT15" value="0x7"/>
         <value caption="2^16 (65536)" name="DMT16" value="0x8"/>
         <value caption="2^17 (131072)" name="DMT17" value="0x9"/>
         <value caption="2^18 (262144)" name="DMT18" value="0xa"/>
         <value caption="2^19 (524288)" name="DMT19" value="0xb"/>
         <value caption="2^20 (1048576)" name="DMT20" value="0xc"/>
         <value caption="2^21 (2097152)" name="DMT21" value="0xd"/>
         <value caption="2^22 (4194304)" name="DMT22" value="0xe"/>
         <value caption="2^23 (8388608)" name="DMT23" value="0xf"/>
         <value caption="2^24 (16777216)" name="DMT24" value="0x10"/>
         <value caption="2^25 (33554432)" name="DMT25" value="0x11"/>
         <value caption="2^26 (67108864)" name="DMT26" value="0x12"/>
         <value caption="2^27 (134217728)" name="DMT27" value="0x13"/>
         <value caption="2^28 (268435456)" name="DMT28" value="0x14"/>
         <value caption="2^29 (536870912)" name="DMT29" value="0x15"/>
         <value caption="2^30 (1073741824)" name="DMT30" value="0x16"/>
         <value caption="2^31 (2147483648)" name="DMT31" value="0x17"/>
      </value-group>
