Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ1024EFH100.atdf
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI6CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI6CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00206" name="SQI" version="2">
      <register-group name="SQI">
         <register caption="SQI XIP Control Register 1" name="SQI1XCON1" offset="0x0" rw="RW" size="4">
            <bitfield caption="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." mask="0x00000003" name="TYPECMD" values="SQI1XCON1__TYPECMD"/>
            <bitfield caption="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." mask="0x0000000C" name="TYPEADDR" values="SQI1XCON1__TYPEADDR"/>
            <bitfield caption="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." mask="0x00000030" name="TYPEMODE" values="SQI1XCON1__TYPEMODE"/>
            <bitfield caption="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" mask="0x000000C0" name="TYPEDUMMY" values="SQI1XCON1__TYPEDUMMY"/>
            <bitfield caption="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." mask="0x00000300" name="TYPEDATA" values="SQI1XCON1__TYPEDATA"/>
            <bitfield mask="0x0003FC00" name="READOPCODE"/>
            <bitfield caption="" mask="0x001C0000" name="ADDRBYTES" values="SQI1XCON1__ADDRBYTES"/>
            <bitfield caption="Transmit Dummy Bytes bits" mask="0x00E00000" name="DUMMYBYTES" values="SQI1XCON1__DUMMYBYTES"/>
            <bitfield caption="SQI DDR Command Mode bit" mask="0x01000000" name="DDRCMD" values="SQI1XCON1__DDRCMD"/>
            <bitfield caption="SQI Address Mode bit" mask="0x02000000" name="DDRADDR" values="SQI1XCON1__DDRADDR"/>
            <bitfield caption="SQI DDR Mode bit" mask="0x04000000" name="DDRMODE" values="SQI1XCON1__DDRMODE"/>
            <bitfield caption="SQI Dummy DDR Mode bit" mask="0x08000000" name="DDRDUMMY" values="SQI1XCON1__DDRDUMMY"/>
            <bitfield caption="SQI Data DDR Mode bit" mask="0x10000000" name="DDRDATA" values="SQI1XCON1__DDRDATA"/>
            <bitfield caption="SQI Command in SDR Mode bit" mask="0x20000000" name="SDRCMD" values="SQI1XCON1__SDRCMD"/>
         </register>
         <register caption="SQI XIP Control Register 2" name="SQI1XCON2" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MODECODE"/>
            <bitfield caption="Mode Byte Cycle Enable bits" mask="0x00000300" name="MODEBYTES" values="SQI1XCON2__MODEBYTES"/>
            <bitfield caption="Device Select bits" mask="0x00000C00" name="DEVSEL" values="SQI1XCON2__DEVSEL"/>
         </register>
         <register caption="SQI Configuration Register" name="SQI1CFG" offset="0x8" rw="RW" size="4">
            <bitfield caption="Mode Select bits" mask="0x00000007" name="MODE" values="SQI1CFG__MODE"/>
            <bitfield caption="Clock Phase Select bit" mask="0x00000008" name="CPHA" values="SQI1CFG__CPHA"/>
            <bitfield caption="Clock Polarity Select bit" mask="0x00000010" name="CPOL" values="SQI1CFG__CPOL"/>
            <bitfield caption="Data Format Select bit" mask="0x00000020" name="LSBF" values="SQI1CFG__LSBF"/>
            <bitfield mask="0x00000200" name="WP"/>
            <bitfield mask="0x00000400" name="HOLD"/>
            <bitfield caption="Burst Configuration bit" mask="0x00001000" name="BURSTEN" values="SQI1CFG__BURSTEN"/>
            <bitfield caption="Software Reset Select bit" mask="0x00010000" name="RESET" values="SQI1CFG__RESET"/>
            <bitfield caption="Transmit Buffer Reset bit" mask="0x00020000" name="TXBUFRST" values="SQI1CFG__TXBUFRST"/>
            <bitfield caption="Receive Buffer Reset bit" mask="0x00040000" name="RXBUFRST" values="SQI1CFG__RXBUFRST"/>
            <bitfield caption="Control Buffer Reset bit" mask="0x00080000" name="CONBUFRST" values="SQI1CFG__CONBUFRST"/>
            <bitfield caption="Data Output Enable bits" mask="0x00300000" name="DATAEN" values="SQI1CFG__DATAEN"/>
            <bitfield caption="SQI Enable bit" mask="0x00800000" name="SQIEN" values="SQI1CFG__SQIEN"/>
            <bitfield caption="Chip Select Output Enable bits" mask="0x03000000" name="CSEN" values="SQI1CFG__CSEN"/>
         </register>
         <register caption="SQI Control Register" name="SQI1CON" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TXRXCOUNT"/>
            <bitfield mask="0x00030000" name="CMDINIT"/>
            <bitfield mask="0x000C0000" name="LANEMODE"/>
            <bitfield caption="SQI Device Select bits" mask="0x00300000" name="DEVSEL" values="SQI1CON__DEVSEL"/>
            <bitfield caption="Chip Select Assert bit" mask="0x00400000" name="DASSERT" values="SQI1CON__DASSERT"/>
            <bitfield caption="Double Data Rate Mode bit" mask="0x00800000" name="DDRMODE" values="SQI1CON__DDRMODE"/>
            <bitfield caption="Flash Status Check bit" mask="0x01000000" name="SCHECK" values="SQI1CON__SCHECK"/>
         </register>
         <register caption="SQI Clock Control Register" name="SQI1CLKCON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Tsqi Clock Enable Select bit" mask="0x00000001" name="EN" values="SQI1CLKCON__EN"/>
            <bitfield caption="Tsqi Clock Stable Select bit" mask="0x00000002" name="STABLE" values="SQI1CLKCON__STABLE"/>
            <bitfield caption="SQI Clock Tsqi Frequency Select bits" mask="0x0007FF00" name="CLKDIV" values="SQI1CLKCON__CLKDIV"/>
         </register>
         <register caption="SQI Command Threshold Register" name="SQI1CMDTHR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000003F" name="RXCMDTHR"/>
            <bitfield mask="0x00003F00" name="TXCMDTHR"/>
         </register>
         <register caption="SQI Interrupt Threshold Register" name="SQI1INTTHR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000003F" name="RXINTTHR"/>
            <bitfield mask="0x00003F00" name="TXINTTHR"/>
         </register>
         <register caption="SQI Interrupt Enable Register" name="SQI1INTEN" offset="0x1c" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Empty Interrupt Enable bit" mask="0x00000001" name="TXEMPTYIE" values="SQI1INTEN__TXEMPTYIE"/>
            <bitfield caption="Transmit Buffer Full Interrupt Enable bit" mask="0x00000002" name="TXFULLIE" values="SQI1INTEN__TXFULLIE"/>
            <bitfield caption="Transmit Buffer Threshold Interrupt Enable bit" mask="0x00000004" name="TXTHRIE" values="SQI1INTEN__TXTHRIE"/>
            <bitfield caption="Receive Buffer Empty Interrupt Enabled bit" mask="0x00000008" name="RXEMPTYIE" values="SQI1INTEN__RXEMPTYIE"/>
            <bitfield caption="Receive Buffer Full Interrupt Enable bit" mask="0x00000010" name="RXFULLIE" values="SQI1INTEN__RXFULLIE"/>
            <bitfield caption="Receive Buffer Threshold Interrupt Enable bit" mask="0x00000020" name="RXTHRIE" values="SQI1INTEN__RXTHRIE"/>
            <bitfield caption="Control Buffer Full Interrupt Enable bit" mask="0x00000040" name="CONFULLIE" values="SQI1INTEN__CONFULLIE"/>
            <bitfield caption="Control Buffer Empty Interrupt Enabled bit" mask="0x00000080" name="CONEMPTYIE" values="SQI1INTEN__CONEMPTYIE"/>
            <bitfield caption="Control Buffer Threshold Interrupt Enable bit" mask="0x00000100" name="CONTHRIE" values="SQI1INTEN__CONTHRIE"/>
            <bitfield caption="DMA Buffer Descriptor Done Interrupt Enable bit" mask="0x00000200" name="BDDONEIE" values="SQI1INTEN__BDDONEIE"/>
            <bitfield caption="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" mask="0x00000400" name="PKTCOMPIE" values="SQI1INTEN__PKTCOMPIE"/>
            <bitfield caption="DMA Bus Error Interrupt Enable bit" mask="0x00000800" name="DMAEIE" values="SQI1INTEN__DMAEIE"/>
         </register>
