Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ1024EFH100.atdf
      <value-group caption="Endpoint 1 RX Interrupt bit" name="USBCSR1__EP1RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 2 RX Interrupt bit" name="USBCSR1__EP2RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 3 RX Interrupt bit" name="USBCSR1__EP3RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 4 RX Interrupt bit" name="USBCSR1__EP4RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 5 RX Interrupt bit" name="USBCSR1__EP5RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 6 RX Interrupt bit" name="USBCSR1__EP6RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 7 RX Interrupt bit" name="USBCSR1__EP7RXIF">
         <value caption="Endpoint has a receive event to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 0 Interrupt Enable bit" name="USBCSR1__EP0IE">
         <value caption="Endpoint 0 interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint 0 interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 1 Transmit Interrupt Enable bits" name="USBCSR1__EP1TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 2 Transmit Interrupt Enable bits" name="USBCSR1__EP2TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 3 Transmit Interrupt Enable bits" name="USBCSR1__EP3TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 4 Transmit Interrupt Enable bits" name="USBCSR1__EP4TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 5 Transmit Interrupt Enable bits" name="USBCSR1__EP5TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 6 Transmit Interrupt Enable bits" name="USBCSR1__EP6TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 7 Transmit Interrupt Enable bits" name="USBCSR1__EP7TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1"/>
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 1 Receive Interrupt Enable bit" name="USBCSR2__EP1RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 2 Receive Interrupt Enable bit" name="USBCSR2__EP2RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 3 Receive Interrupt Enable bit" name="USBCSR2__EP3RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 4 Receive Interrupt Enable bit" name="USBCSR2__EP4RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 5 Receive Interrupt Enable bit" name="USBCSR2__EP5RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 6 Receive Interrupt Enable bit" name="USBCSR2__EP6RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 7 Receive Interrupt Enable bit" name="USBCSR2__EP7RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1"/>
         <value caption="Receive interrupt is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suspend Interrupt bit" name="USBCSR2__SUSPIF">
         <value caption="Suspend signaling is detected on the bus (Device mode)" name="" value="0x1"/>
         <value caption="No suspend signaling detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Resume Interrupt bit" name="USBCSR2__RESUMEIF">
         <value caption="Resume signaling is detected on the bus while USB module is in Suspend mode" name="" value="0x1"/>
         <value caption="No Resume signaling detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reset/Babble Interrupt bit" name="USBCSR2__RESETIF">
         <value caption="(In Host mode): indicates babble is detected / (In Device mode): indicates reset signaling is detected on the bus." name="" value="0x1"/>
         <value caption="No reset/babble detected" name="" value="0x0"/>
      </value-group>
